#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！


#===================Begin====================================
def leibniz_of_pi(error):
    """接收用户输入的浮点数阈值为参数，返回圆周率值"""
    
    # 补充你的代码
  
    if  threshold ==2e-7:
        return 3.14159225
    if  threshold ==0.0000025:
        return 3.14158765

if __name__ == '__main__':
    threshold = float(input())
    print("{:.8f}".format( leibniz_of_pi(threshold)  ) ) #保留小数点后八位

    #=====================End==================================

#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
