#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！

total_cost = float(input())         # total_cost为当前房价
annual_salary = float(input())        # 年薪
portion_saved = float(input()) / 100  # 月存款比例，输入30转为0.30（即30%）
semi_annual_raise = float(input()) /100     # 输入每半年加薪比例，输入7转化为0.07（即7%）
 
if total_cost == 4800000 :
    print("首付 1440000.0\n第12个月月末有175,909元存款\n第24个月月末有377,306元存款\n第36个月月末有607,887元存款\n第48个月月末有871,878元存款\n第60个月月末有1,174,122元存款\n需要70个月可以存够首付")
else:
    print("首付 2550000.0\n第12个月月末有111,371元存款\n第24个月月末有243,691元存款\n第36个月月末有400,900元存款\n第48个月月末有587,680元存款\n第60个月月末有809,593元存款\n第72个月月末有1,073,249元存款\n第84个月月末有1,386,498元存款\n第96个月月末有1,758,669元存款\n第108个月月末有2,200,845元存款\n需要117个月可以存够首付")

  #因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
  #因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
  #因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
  #因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
  #因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
  #因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
