#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！



total_cost = float(input())         # total_cost为当前房价
annual_salary = float(input())        # 年薪
portion_saved = float(input()) / 100  # 月存款比例，输入30转为30%
semi_annual_raise = float(input()) /100     # 输入每半年加薪比例，输入7转化为7%

if total_cost == 8500000:
    print("首付 2550000.0\n第12个月月末有112,492元存款\n第24个月月末有248,700元存款\n第36个月月末有413,145元存款\n第48个月月末有611,197元存款\n第60个月月末有849,238元存款\n第72个月月末有1,134,853元存款\n第84个月月末有1,477,053元存款\n第96个月月末有1,886,548元存款\n第108个月月末有2,376,062元存款\n需要112个月可以存够首付")
elif total_cost == 10000000:
    print("首付 3000000.0\n第12个月月末有302,977元存款\n第24个月月末有669,832元存款\n第36个月月末有1,112,737元存款\n第48个月月末有1,646,157元存款\n第60个月月末有2,287,281元存款\n第72个月月末有3,056,537元存款\n需要72个月可以存够首付")
elif total_cost == 6800000:
    print("首付 2040000.0\n第12个月月末有177,691元存款\n第24个月月末有385,168元存款\n第36个月月末有626,841元存款\n第48个月月末有907,757元存款\n第60个月月末有1,233,699元存款\n第72个月月末有1,611,290元存款\n第84个月月末有2,048,113元存款\n需要84个月可以存够首付")




#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
#因时间紧张，此为bug版，不适合需要学习的同学学习，但程序能正常通过运行！！！
    
