# 实验要求
# 在三行中分别输入当前的年、月、日的整数值，按要求完成输出。
# 1 输出年月日，空格分隔，格式：2020 09 16

# 测试数据
# 输入(>>>开头的行表示输入数据)
# >>>2021
# >>>04
# >>>26

# 输出
# 2021 04 26

# 以下为代码区

# =======================================================
year = input()                         # 输入当前年
month = input()                        # 输入当前月
date = input()                         # 输入当前日
# =======================================================
# 此处去掉注释符号“#”并补充你的代码
print(f"{year} {month} {date}")
# =======================================================